verification/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (.02 0 0)
    (0.02 .004 0)
    (0 .004 0)
    (0 0 0.001)
    (0.02 0 0.001)
    (.02 .004 0.001)
    (0 .004 0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 10 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    Inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            //(2 6 5 1)
          //  (1 5 4 0)
        );
    }
    Outlet
    {
        type patch;
        faces
        (
           // (0 4 7 3)
            (2 6 5 1)
          //  (1 5 4 0)
        );
    }
    Bottom
    {
        type wall;
        faces
        (
            //(0 4 7 3)
           // (2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
