verification/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<vector> 
50
(
(3.6935 0 0)
(3.6935 0 0)
(3.6935 0 0)
(3.6935 0 0)
(3.6935 0 0)
(3.6935 0 0)
(3.6935 0 0)
(3.6935 0 0)
...
)
;
    }
    Inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    Outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    Bottom
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
